#+title:      selecting columns of data in the tidyverse
#+date:       [2023-01-30 Mon 20:47]
#+filetags:   :datascience:
#+identifier: 20230130T204706

Selecting columns in a dataset.

#+begin_src R
  library(palmerpenguins)
  library(dplyr)

  penguins |>
    select(species, island, bill_length_mm) |>
    head()
#+end_src

#+RESULTS:
| species | island    | =bill_length_mm= |
| Adelie  | Torgersen |           39.1 |
| Adelie  | Torgersen |           39.5 |
| Adelie  | Torgersen |           40.3 |
| Adelie  | Torgersen |                |
| Adelie  | Torgersen |           36.7 |
| Adelie  | Torgersen |           39.3 |
